app/controllers/admins/categories_controller.rb

	def index
		@category = Category.new
		@categories = Category.all
---
SELECT "categories".* FROM "categories"

	def create
		@category = Category.new(category_params)
		@category.save
---
INSERT INTO "categories" ("name", "flag", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "1"], ["flag", 1], ["created_at", "2020-05-19 12:22:36.943958"], ["updated_at", "2020-05-19 12:22:36.943958"]]

	def update
		category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]