app/controllers/admins/ordered_products_controller.rb

	def update
		ordered_product = OrderedProduct.find(params[:id])
		ordered_product.update(ordered_products_params)
		order = ordered_product.order
		ordered_products_flag = OrderedProduct.where(order_id: order.id,flag: 4)
		ordered_products = OrderedProduct.where(order_id: order.id)

		if ordered_product.flag == 3
			order.update(flag: 3)
  			redirect_to request.referer
		elsif ordered_products_flag.count == ordered_products.count
			#flag=4の注文商品数とflag=?な注文商品数の要素数が一致するということは全てflag=4になったということを示している
			order.update(flag: 4)
---
SELECT  "ordered_products".* FROM "ordered_products" WHERE "ordered_products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "flag" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["flag", 3], ["updated_at", "2020-05-20 14:17:07.035040"], ["id", 1]]
UPDATE "ordered_products" SET "flag" = ?, "updated_at" = ? WHERE "ordered_products"."id" = ?  [["flag", 2], ["updated_at", "2020-05-20 12:16:01.966427"], ["id", 1]]
SELECT  "ordered_products".* FROM "ordered_products" LIMIT ?  [["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "ordered_products".* FROM "ordered_products" WHERE "ordered_products"."order_id" = ?  [["order_id", 1]]
UPDATE "ordered_products" SET "flag" = ?, "updated_at" = ? WHERE "ordered_products"."id" = ?  [["flag", 1], ["updated_at", "2020-05-20 13:10:18.831680"], ["id", 1]]
UPDATE "orders" SET "flag" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["flag", 4], ["updated_at", "2020-05-20 14:27:24.989520"], ["id", 1]]
SELECT COUNT(*) FROM "ordered_products" WHERE "ordered_products"."order_id" = ? AND "ordered_products"."flag" = ?  [["order_id", 1], ["flag", 4]]
UPDATE "orders" SET "flag" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["flag", 4], ["updated_at", "2020-05-20 14:35:22.451661"], ["id", 1]]