app/controllers/admins/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "ordered_products".* FROM "ordered_products" WHERE "ordered_products"."order_id" = ?  [["order_id", 1]]
---
	def show
		@order = Order.find(params[:id])
		@ordered_products = @order.ordered_products

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "flag" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["flag", 4], ["updated_at", "2020-05-20 01:29:02.017490"], ["id", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "ordered_products".* FROM "ordered_products" WHERE "ordered_products"."order_id" = ?  [["order_id", 1]]
UPDATE "ordered_products" SET "flag" = ?, "updated_at" = ? WHERE "ordered_products"."id" = ?  [["flag", 2], ["updated_at", "2020-05-20 12:44:12.872073"], ["id", 1]]
---
	def update
		order = Order.find(params[:id])
		order.update(orders_params)
		ordered_products = order.ordered_products
		if order.flag == 2
			ordered_products.update(flag: 2)