app/controllers/admins/products_controller.rb

  def index
  	@product = Product.all
---
SELECT "products".* FROM "products"

  def new
  	@product = Product.new
  	@categories = Category.where(flag: 1)
---
SELECT "categories".* FROM "categories" WHERE "categories"."flag" = ?  [["flag", 1]]

  def edit
  	@product = Product.find(params[:id])
  	@categories = Category.where(flag: 1)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."flag" = ?  [["flag", 1]]

  def create
  	@product = Product.new(product_params)
  	if @product.save
---
INSERT INTO "products" ("category_id", "name", "text", "image_id", "now_price", "created_at", "updated_at", "flag") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["category_id", 1], ["name", "1"], ["text", "1"], ["image_id", nil], ["now_price", 1], ["created_at", "2020-05-19 12:22:49.645325"], ["updated_at", "2020-05-19 12:22:49.645325"], ["flag", 1]]