app/controllers/admins/users_controller.rb

	def index
		@users = User.page(params[:page]).per(10)
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]