app/controllers/carts_controller.rb

  def index
    @carts = current_user.carts
    @total_price = 0
    @carts.each do |cart|
---
SELECT "carts".* FROM "carts"

  def create
    @product = Product.find(params[:id])
    cart = Cart.find_by(product_id: @product.id, user_id: current_user.id)
    @cart = Cart.new(cart_params)
    if cart.present? && @cart.number.present?
      total_number = 0
      total_number = cart.number + @cart.number
      cart.update(number: total_number)
      redirect_to users_carts_path
    else
      @cart.product_id = @product.id
      @cart.user_id = current_user.id
      if @cart.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."product_id" = ? AND "carts"."user_id" = ? LIMIT ?  [["product_id", 1], ["user_id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "product_id", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["product_id", 1], ["number", 1], ["created_at", "2020-05-19 12:24:34.292451"], ["updated_at", "2020-05-19 12:24:34.292451"]]