app/controllers/products_controller.rb

  def index
  	@categories = Category.where(flag: 1)
    @products = Product.all
    @total_number = 0
    @categories.each do |category|
      @total_number += category.products.count
---
SELECT "categories".* FROM "categories" WHERE "categories"."flag" = ?  [["flag", 1]]
SELECT "products".* FROM "products"
SELECT COUNT(*) FROM "products"

  def show
  	@product = Product.find(params[:id])
  	@categories = Category.where(flag: 1)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."flag" = ?  [["flag", 1]]

  def judge
  	@category = Category.find(params[:id])
  	@products = @category.products
  	@categories = Category.where(flag: 1)
    @total_number = @products.count
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."flag" = ?  [["flag", 1]]
SELECT COUNT(*) FROM "products" WHERE "products"."category_id" = ?  [["category_id", 1]]