app/views/admins/orders/index.html.erb

SELECT  "ordered_products".* FROM "ordered_products" WHERE "ordered_products"."order_id" = ? LIMIT ?  [["order_id", 1], ["LIMIT", 11]]
SELECT "orders".* FROM "orders"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <%= order.created_at.strftime("%Y-%m-%d %H:%M:%S") %>
          <!-- config/applocation.rbで(config.time_zone = 'Tokyo'）日本時間に変更済み -->
          <% end %>
        </th>
        <th><%= order.user.family_name + order.user.last_name %></th>
        <th><%= order.ordered_products.sum(:number) %></th>
        <th>
          <% if order.flag == 1 %>
            <p>入金待ち</p>
          <% elsif order.flag == 2 %>
            <p>入金確認</p>
          <% elsif order.flag == 3 %>
            <p>製作中</p>
          <% elsif order.flag == 4 %>
            <p>発送準備中</p>
          <% elsif order.flag == 5%>
            <p>発送済み</p>
          <% end %>
        </th>
      </tr>
    <% end %>
  </tbody>